faronov/cc2530-zigbee/tests/test_zcl_identify.c
static uint16_t native_clock(void)
{
    uint32_t sec, base, now;
    unsigned k;
    uint8_t cmd[] = {0x11, 0x5a, 0, 0xff, 0xff};
    static const uint16_t offsets[] = {0, 1, 999};
    base = 0xffffff00UL;
    CHECK(zcl_id_init(&ctx, base) == ZCL_CODEC_OK);
    CHECK(zcl_id_rx(&ctx, base, cmd, 5, response, 0, &info) == ZCL_CODEC_OK);
    /* Every boundary of the maximum duration, including wrapped timestamps. */
    for (sec = 0; sec <= 65535UL; sec++) {
        for (k = 0; k < 3; k++) {
            now = base + sec * 1000UL + offsets[k];
            CHECK(zcl_id_tick(&ctx, now) == ZCL_CODEC_OK);
            CHECK(ctx.remaining == 65535UL - sec && ctx.phase == (sec == 65535UL ? 0 : offsets[k]));
        }
    }
    /* Fractional accumulation, mixed commands/ticks and many clock wraps.
     * Independent absolute-deadline oracle, not the production recurrence. */
    {
        uint64_t absolute = 0, deadline = 0;
        uint32_t random = 0x13579bdfUL;
        unsigned i;
        CHECK(zcl_id_init(&ctx, 0) == ZCL_CODEC_OK);
        for (i = 0; i < 20000; i++) {
            random = random * 1664525UL + 1013904223UL;
            absolute += i % 11 == 0 ? 0x7fffffffUL : random % 1973u;
            if (i % 7 == 0) {
                uint16_t duration = (uint16_t)random;
                cmd[3] = (uint8_t)duration; cmd[4] = (uint8_t)(duration >> 8);
                CHECK(zcl_id_rx(&ctx, (uint32_t)absolute, cmd, 5, response, 0, &info) == ZCL_CODEC_OK);
                deadline = absolute + (uint64_t)duration * 1000u;
            } else {
                CHECK(zcl_id_tick(&ctx, (uint32_t)absolute) == ZCL_CODEC_OK);
            }
            CHECK(ctx.stamp == (uint32_t)absolute);
            CHECK(ctx.remaining == (absolute >= deadline ? 0 : (deadline - absolute + 999u) / 1000u));
            CHECK(ctx.phase == (absolute >= deadline ? 0 : (1000u - (deadline - absolute) % 1000u) % 1000u));
        }
    }
    return 0;
}

static uint16_t exact_native(void)
{
    zcl_id_t *c = malloc(sizeof(*c)), *before = malloc(sizeof(*before));
    zcl_dispatch_info_t *result = malloc(sizeof(*result));
    uint8_t *in, *out;
    uint8_t expected[5];
    unsigned mode, n, cap, stored, wanted;
    zcl_codec_result_t rc, want;
    CHECK(c != NULL && before != NULL && result != NULL);
    for (mode = 0; mode < 4; mode++) { /* Identify, active/idle Query, no-default Identify */
        for (n = 0; n <= 102; n++) {
            in = malloc(n ? n : 1);
            CHECK(in != NULL);
            memset(in, 0xee, n ? n : 1);
            if (n) in[0] = mode == 3 ? 0x11 : 1;
            if (n > 1) in[1] = 0x5a;
            if (n > 2) in[2] = mode == 1 || mode == 2 ? 1 : 0;
            if (n > 3) in[3] = 2;
            if (n > 4) in[4] = 0;
            for (cap = 0; cap <= 6; cap++) {
                stored = cap ? cap : 1;
                out = malloc(stored);
                CHECK(out != NULL);
                memset(out, 0xc7, stored); memset(result, 0xa5, sizeof(*result));
                CHECK(zcl_id_init(c, 0) == ZCL_CODEC_OK);
                if (mode != 2) CHECK(zcl_id_rx(c, 0, start, 5, response, 5, &info) == ZCL_CODEC_OK);
                memcpy(before, c, sizeof(*c));
                wanted = mode == 2 || (mode == 3 && n >= 5) ? 2u : 0u;
                want = n > 100 ? ZCL_CODEC_TOO_LONG : n < 3 ? ZCL_CODEC_TRUNCATED :
                       wanted == 0 && cap < 5 ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
                rc = zcl_id_rx(c, 1001, in, (uint16_t)n, out, (uint16_t)cap, result);
                CHECK(rc == want);
                if (rc != ZCL_CODEC_OK) {
                    CHECK(memcmp(c, before, sizeof(*c)) == 0);
                    CHECK(filled(out, (uint16_t)stored, 0xc7) && filled(result, sizeof(*result), 0xa5));
                } else {
                    CHECK(result->kind == wanted && result->sequence == 0x5a && c->stamp == 1001);
                    CHECK(c->remaining == (mode == 2 ? 0 : 2));
                    CHECK(c->phase == ((mode == 1 || n < 5) && mode != 2 ? 1 : 0));
                    if (wanted == 2) {
                        CHECK(result->length == 0 && filled(out, (uint16_t)stored, 0xc7));
                    } else {
                        memcpy(expected, ack, 5);
                        if (mode == 1) { expected[0] = 0x19; expected[2] = 0; expected[3] = 2; }
                        else if (n < 5) expected[4] = 0x80;
                        CHECK(result->length == 5 && memcmp(out, expected, 5) == 0);
                        CHECK(filled(out + 5, (uint16_t)(stored - 5), 0xc7));
                    }
                }
                if (n) CHECK(in[0] == (mode == 3 ? 0x11 : 1));
                if (n > 5) CHECK(filled(in + 5, (uint16_t)(n - 5), 0xee));
                free(out);
            }
            free(in);
        }
    }
    free(result); free(before); free(c);
    return 0;
}

static uint16_t native_globals(void)
{
    zcl_id_t *c = malloc(sizeof(*c)), *before = malloc(sizeof(*before));
    zcl_dispatch_info_t *out = malloc(sizeof(*out));
    uint8_t *input, *output;
    uint8_t expected[15];
    unsigned mode, n, cap, used, count;
    zcl_codec_result_t want;
    CHECK(c != NULL && before != NULL && out != NULL);
    for (mode = 0; mode < 2; mode++) {
        for (n = mode ? 7u : 0u; n <= (mode ? 7u : 102u); n++) {
            input = malloc(n ? n : 1);
            CHECK(input != NULL);
            memset(input, 0xee, n ? n : 1);
            memcpy(input, mode ? read : discover, mode ? 7u : n < 6u ? n : 6u);
            for (cap = 0; cap <= 102; cap++) {
                output = malloc(cap ? cap : 1);
                CHECK(output != NULL);
                memset(output, 0xc7, cap ? cap : 1); memset(out, 0xa5, sizeof(*out));
                CHECK(zcl_id_init(c, 0) == ZCL_CODEC_OK);
                CHECK(zcl_id_rx(c, 0, start, 5, response, 5, &info) == ZCL_CODEC_OK);
                memcpy(before, c, sizeof(*c));
                want = n > 100 ? ZCL_CODEC_TOO_LONG : n < 3 ? ZCL_CODEC_TRUNCATED :
                       cap < (mode ? 6u : n < 6 ? 5u : 7u) ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
                CHECK(zcl_id_rx(c, 1000, input, (uint16_t)n, output, (uint16_t)cap, out) == want);
                if (want != ZCL_CODEC_OK) {
                    CHECK(memcmp(c, before, sizeof(*c)) == 0);
                    CHECK(filled(output, (uint16_t)(cap ? cap : 1), 0xc7) && filled(out, sizeof(*out), 0xa5));
                } else {
                    CHECK(c->remaining == 2 && c->phase == 0 && c->stamp == 1000);
                    if (mode) {
                        unsigned i;
                        memcpy(expected, read_two, 3);
                        used = 3; count = 0;
                        for (i = 0; i < 2 && used + 3 <= cap; i++) {
                            memcpy(expected + used, read_two + 3 + 6u * i, 2);
                            if (used + 6 <= cap) {
                                memcpy(expected + used + 2, read_two + 5 + 6u * i, 4);
                                used += 6;
                            } else {
                                expected[used + 2] = 0x89; used += 3;
                            }
                            count++;
                        }
                        CHECK(out->requested_count == 2 && out->returned_count == count);
                    } else if (n < 6) {
                        memcpy(expected, "\x18\x5a\x0b\x0c\x80", 5); used = 5;
                    } else {
                        count = (cap - 4u) / 3u; if (count > 2) count = 2;
                        used = 4 + 3u * count;
                        memcpy(expected, discover_two, used);
                        expected[3] = count == 2;
                        CHECK(out->returned_count == count && out->discovery_complete == (count == 2));
                    }
                    CHECK(out->length == used && memcmp(output, expected, used) == 0);
                    CHECK(filled(output + used, (uint16_t)(cap - used), 0xc7));
                }
                CHECK(memcmp(input, mode ? read : discover, mode ? 7u : n < 6 ? n : 6u) == 0);
                if (!mode && n > 6) CHECK(filled(input + 6, (uint16_t)(n - 6), 0xee));
                free(output);
            }
            free(input);
        }
    }
    free(out); free(before); free(c);
    return 0;
}

static uint16_t native_writes(void)
{
    static const uint8_t bytes[] = {0,0x5a,2,0,0,0x21,7,0,1,0,0,0xee};
    zcl_id_t *c = malloc(sizeof(*c)), before;
    zcl_dispatch_info_t *result = malloc(sizeof(*result)), expected;
    unsigned command, n, cap, mode;
    uint8_t *in, *out, golden[6], used, value;
    zcl_codec_result_t rc, want;
    CHECK(c != NULL && result != NULL);
    for (command = 2; command <= 5; command++) {
        if (command == 4) continue;
        for (mode = 0; mode < 4; mode++) {
            for (n = 0; n <= sizeof(bytes); n++) {
                in = malloc(n ? n : 1);
                CHECK(in != NULL);
                memcpy(in, bytes, n);
                if (n) in[0] = (uint8_t)((mode & 1u ? 0x10 : 0) | (mode & 2u ? 0xe0 : 0));
                if (n > 2) in[2] = (uint8_t)command;
                for (cap = 0; cap <= 7; cap++) {
                    out = malloc(cap ? cap : 1);
                    CHECK(out != NULL);
                    memset(out, 0xc7, cap ? cap : 1);
                    memset(result, 0xa5, sizeof(*result));
                    CHECK(zcl_id_init(c, 0) == ZCL_CODEC_OK);
                    CHECK(zcl_id_rx(c, 0, start, 5, response, 5, &info) == ZCL_CODEC_OK);
                    before = *c;
                    used = command == 5 ? 0 : n == 8 ? 4 : n == 11 ? 6 : 5;
                    want = n < 3 || (command == 5 && n != 8 && n != 11) ? ZCL_CODEC_TRUNCATED
                        : cap < used ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
                    rc = zcl_id_rx(c, 999, in, (uint16_t)n, out, (uint16_t)cap, result);
                    CHECK(rc == want);
                    if (n > 2) CHECK(in[2] == command);
                    if (n > 3) CHECK(memcmp(in + 3, bytes + 3, n - 3) == 0);
                    if (rc != ZCL_CODEC_OK) {
                        CHECK(memcmp(c, &before, sizeof(before)) == 0);
                        CHECK(filled(result, sizeof(*result), 0xa5) && filled(out, (uint16_t)(cap ? cap : 1), 0xc7));
                    } else {
                        value = n == 8 || (n == 11 && command != 3) ? 7 : 3;
                        CHECK(c->stamp == 999 && c->remaining == value && c->phase == (value == 7 ? 0 : 999));
                        memset(&expected, 0, sizeof(expected));
                        expected.sequence = 0x5a; expected.length = used;
                        expected.kind = command == 5 ? 2 : 0;
                        if (command != 5) {
                            golden[0] = 0x18; golden[1] = 0x5a;
                            if (n == 8 || n == 11) {
                                expected.command_id = golden[2] = 4;
                                expected.requested_count = n == 8 ? 1 : 2;
                                expected.returned_count = 1;
                                golden[3] = n == 8 ? 0 : 0x86;
                                golden[4] = 1; golden[5] = 0;
                            } else {
                                expected.command_id = golden[2] = 0x0b;
                                expected.default_command = golden[3] = (uint8_t)command;
                                expected.default_status = expected.default_raw_status = golden[4] = 0x80;
                            }
                        }
                        CHECK(memcmp(result, &expected, sizeof(expected)) == 0);
                        CHECK(memcmp(out, golden, used) == 0);
                        CHECK(filled(out + used, (uint16_t)((cap ? cap : 1) - used), 0xc7));
                    }
                    free(out);
                }
                free(in);
            }
        }
    }
    /* Every uint16 value is valid, including FFFF. Repeated same-TSN writes
     * restart the phase; exact expiry uses an independent absolute deadline. */
    {
        uint32_t duration, base = 0xffffff00UL;
        uint8_t input[] = {0,0x5a,2,0,0,0x21,0,0};
        uint64_t deadline;
        for (duration = 0; duration <= 65535UL; duration++) {
            CHECK(zcl_id_init(c, base) == ZCL_CODEC_OK);
            input[2] = 2; input[6] = (uint8_t)duration; input[7] = (uint8_t)(duration >> 8);
            CHECK(zcl_id_rx(c, base, input, 8, response, 4, result) == ZCL_CODEC_OK);
            CHECK(c->remaining == duration && c->phase == 0);
            CHECK(zcl_id_tick(c, base + 999u) == ZCL_CODEC_OK && c->phase == (duration ? 999 : 0));
            input[2] = 5;
            CHECK(zcl_id_rx(c, base + 999u, input, 8, response, 0, result) == ZCL_CODEC_OK);
            CHECK(c->remaining == duration && c->phase == 0 && result->kind == 2);
            deadline = (uint64_t)base + 999u + (uint64_t)duration * 1000u;
            if (duration) {
                CHECK(zcl_id_tick(c, (uint32_t)(deadline - 1u)) == ZCL_CODEC_OK);
                CHECK(c->remaining == 1 && c->phase == 999);
            }
            CHECK(zcl_id_tick(c, (uint32_t)deadline) == ZCL_CODEC_OK && c->remaining == 0 && c->phase == 0);
        }
    }
    free(result); free(c);
    return 0;
}

int main(void)
{
    uint16_t rc = run_tests();
    if (!rc) rc = native_clock();
    if (!rc) rc = exact_native();
    if (!rc) rc = native_globals();
    if (!rc) rc = native_writes();
    if (rc) {
        fprintf(stderr, "Identify test failed at C line %u\n", rc);
        return 1;
    }
    printf("Identify: %u common cases; maximum countdown/clock oracle and exact native allocations PASS.\n", cases);
    return 0;
}
#endif
